<?php

return [
    'success' => 1,
    'error'   => 0,
    'msg' => [
        '1000' => '管理员名称或者密码不对',
        '2000' => '管理员状态修改成功',
        '2001' => '管理员状态修改失败',
        '2002' => '管理员添加成功',
        '2003' => '管理员添加失败',
        '2004' => '管理员密码不得为空',
        '2005' => '管理员密码重置成功',
        '2006' => '管理员密码重置失败',
        '2007' => '管理员信息更新成功',
        '2008' => '管理员信息更新失败',
        '2009' => '管理员删除成功',
        '2010' => '管理员删除失败',
        '2011' => '管理员分配角色成功',
        '2012' => '管理员分配角色失败',
        
        '3000' => '角色创建成功',
        '3001' => '角色创建失败',
        '3002' => '角色编辑成功',
        '3003' => '角色编辑失败',
        '3004' => '角色删除成功',
        '3005' => '角色删除失败',
        '3006' => '角色分配权限为空',
        '3007' => '角色分配失败',
        '3008' => '角色分配成功',
        

        '5000' => '权限创建成功',
        '5001' => '权限创建失败',
        '5002' => '权限删除成功',
        '5003' => '该权限存在子权限不能删除',
        '5004' => '权限删除失败',
        '5005' => '权限编辑成功',
        '5006' => '权限编辑失败',

        '10000' => '会员账号,转账金额,平台订单号,用户收款账号,账号类型不得为空!',
    ]  
];
